In [1]:
import pandas as pd

# Load raw data
crops = pd.read_csv("../data/raw/crop_yield.csv")
climate = pd.read_csv("../data/raw/climate.csv")
co2 = pd.read_csv("../data/raw/co2.csv")

# Peek at datasets
print("Crops:")
display(crops.head())

print("\nClimate:")
display(climate.head())

print("\nCO2:")
display(co2.head())

Crops:

,State_Name,District_Name,Crop_Year,Season,Crop,Area,Production
0,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,NICOBARS,2000,Kharif,Rice,102.0,321.0
3,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Banana,176.0,641.0
4,Andaman and Nicobar Islands,NICOBARS,2000,Whole Year,Cashewnut,720.0,165.0

Climate:

,dt,AverageTemperature,AverageTemperatureUncertainty,City,Country,Latitude,Longitude
0,1743-11-01,6.068,1.737,Århus,Denmark,57.05N,10.33E
1,1743-12-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
2,1744-01-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
3,1744-02-01,NaN,NaN,Århus,Denmark,57.05N,10.33E
4,1744-03-01,NaN,NaN,Århus,Denmark,57.05N,10.33E

CO2:

,Entity,Code,Year,Share of global annual CO₂ consumption-based emissions,Share of world population
0,Afghanistan,AFG,-10000,NaN,0.327405
1,Afghanistan,AFG,-9000,NaN,0.358793
2,Afghanistan,AFG,-8000,NaN,0.386254
3,Afghanistan,AFG,-7000,NaN,0.405317
4,Afghanistan,AFG,-6000,NaN,0.407928